<?php

namespace App\Service;


class Branch
{
    const DATA = [
        'TRG' => [
            'name' => 'ЕГЭ-Центр-Тургеневская',
            'time' => '11:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Мясницкая, д. 40, стр. 1',
            'color' => '#FBAA33',
            'coords' => [
                'lat' => 55.76678,
                'lng' => 37.64141,
            ]
        ],
        'PVN' => [
            'name' => 'ЕГЭ-Центр-Вернадского',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'проспект Вернадского д. 37, к. 2',
            'color' => '#EF1E25',
            'coords' => [
                'lat' => 55.676986,
                'lng' => 37.509622
            ]
        ],
        'BGT' => [
            'name' => 'ЕГЭ-Центр-Багратионовская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Барклая, д. 13, стр. 2',
            'color' => '#019EE0',
            'coords' => [
                'lat' => 55.744683,
                'lng' => 37.494297
            ]
        ],
        'IZM' => [
            'name' => 'ЕГЭ-Центр-Багратионовская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. 1-я Парковая, дом 7',
            'color' => '#0252A2',
            'coords' => [
                'lat' => 55.789345,
                'lng' => 37.777526
            ]
        ],
        'OPL' => [
            'name' => 'ЕГЭ-Центр-Октябрьское поле',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Маршала Бирюзова, дом 1, корпус 1',
            'color' => '#B61D8E',
            'coords' => [
                'lat' => 55.789709,
                'lng' => 37.498896
            ]
        ],
        'RPT' => [
            'name' => 'ЕГЭ-Центр-Рязанский Проспект',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Маршала Бирюзова, дом 1, корпус 1',
            'color' => '#B61D8E',
            'coords' => [
                'lat' => 55.714663,
                'lng' => 37.790893
            ]
        ],
        'VKS' => [
            'name' => 'ЕГЭ-Центр-Войковская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Старопетровский проезд, дом 7А, строение 6',
            'color' => '#029A55',
            'coords' => [
                'lat' => 55.824602,
                'lng' => 37.501384
            ]
        ],
        'ORH' => [
            'name' => 'ЕГЭ-Центр-Орехово',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Домодедовская, дом 20, стр. 1',
            'color' => '#029A55',
            'coords' => [
                'lat' => 55.612853,
                'lng' => 37.702113
            ]
        ],
        'UJN' => [
            'name' => 'ЕГЭ-Центр-Южная',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Варшавское шоссе, дом 132, стр. 9',
            'color' => '#ACADAF',
            'coords' => [
                'lat' => 55.620901,
                'lng' => 37.610449
            ]
        ],
        'PER' => [
            'name' => 'ЕГЭ-Центр-Перово',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Зеленый проспект, дом 20',
            'color' => '#FFD803',
            'coords' => [
                'lat' => 55.750038,
                'lng' => 37.787192
            ]
        ],
        'KLG' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Обручева, дом 27, кор. 8',
            'color' => '#C07911',
            'coords' => [
                'lat' => 55.656311,
                'lng' => 37.551384
            ]
        ],
        'BRT' => [
            'name' => 'ЕГЭ-Центр-Братиславская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Братиславская, дом 6',
            'color' => '#B1D332',
            'coords' => [
                'lat' => 55.664055,
                'lng' => 37.753245
            ]
        ],
        'MLD' => [
            'name' => 'ЕГЭ-Центр-Молодежная',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Партизанская, д. 25',
            'color' => '#0252A2',
            'coords' => [
                'lat' => 55.73591,
                'lng' => 37.41111,
            ]
        ],
        'VLD' => [
            'name' => 'ЕГЭ-Центр-Владыкино',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Гостиничная улица, д. 3',
            'color' => '#ACADAF',
            'coords' => [
                'lat' => 55.842661,
                'lng' => 37.579619
            ]
        ]
    ];

    public static function get($branch)
    {
        return (object)self::DATA[$branch];
    }

    public static function getJson()
    {
        return json_encode(self::DATA);
    }
}
