<?php

namespace App\Models;


class Branch
{
    const DATA = [
        'TRG' => [
            'name' => 'ЕГЭ-Центр-Тургеневская',
            'time' => '11:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Мясницкая, д. 40, стр. 1'
        ],
        'PVN' => [
            'name' => 'ЕГЭ-Центр-Вернадского',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'проспект Вернадского д. 37, к. 2'
        ],
        'BGT' => [
            'name' => 'ЕГЭ-Центр-Багратионовская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Барклая, д. 13, стр. 2'
        ],
        'IZM' => [
            'name' => 'ЕГЭ-Центр-Багратионовская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. 1-я Парковая, дом 7'
        ],
        'OPL' => [
            'name' => 'ЕГЭ-Центр-Октябрьское поле',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Маршала Бирюзова, дом 1, корпус 1'
        ],
        'RPT' => [
            'name' => 'Рязанский Проспект',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Маршала Бирюзова, дом 1, корпус 1'
        ],
        'VKS' => [
            'name' => 'ЕГЭ-Центр-Войковская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Старопетровский проезд, дом 7А, строение 6'
        ],
        'ORH' => [
            'name' => 'ЕГЭ-Центр-Орехово',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Домодедовская, дом 20, стр. 1'
        ],
        'UJN' => [
            'name' => 'ЕГЭ-Центр-Южная',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Варшавское шоссе, дом 132, стр. 9'
        ],
        'PER' => [
            'name' => 'ЕГЭ-Центр-Перово',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Зеленый проспект, дом 20'
        ],
        'KLG' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Обручева, дом 27, кор. 8'
        ],
        'BRT' => [
            'name' => 'ЕГЭ-Центр-Братиславская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Братиславская, дом 6'
        ],
        'MLD' => [
            'name' => 'ЕГЭ-Центр-Молодежная',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Партизанская, д. 25'
        ],
        'VLD' => [
            'name' => 'ЕГЭ-Центр-Владыкино',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Гостиничная улица, д. 3'
        ]
    ];

    public static function get($branch)
    {
        return (object)self::DATA[$branch];
    }
}
