<?php

namespace App\Models;


class Branch
{
    const DATA = [
        'TRG' => [
            'name' => 'ЕГЭ-Центр-Тургеневская',
            'time' => '11:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'ул. Мясницкая, д. 40, стр. 1'
        ],
    	'PVN' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'BGT' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'IZM' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'OPL' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'RPT' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'VKS' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'ORH' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'UJN' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'PER' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'KLG' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'BRT' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'MLD' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ],
    	'VLD' => [
            'name' => 'ЕГЭ-Центр-Калужская',
            'time' => '12:00-20:00',
            'phone' => '+7 (495) 646-85-92',
            'address' => 'Научный проезд, д. 8, стр. 1'
        ]
    ];

    public static function get($branch)
    {
        return (object)self::DATA[$branch];
    }
}
